wrk/output/stage_2/2_put_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.448ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.651ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.592ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.499ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms  411.38us   8.26ms   72.77%
    Req/Sec   262.93     50.68   444.00     63.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%    1.31ms
 90.000%    1.53ms
 99.000%    2.11ms
 99.900%    4.37ms
 99.990%    6.85ms
 99.999%    8.26ms
100.000%    8.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.198     0.000000            1         1.00
       0.590     0.100000         2005         1.11
       0.721     0.200000         4013         1.25
       0.838     0.300000         6011         1.43
       0.945     0.400000         8007         1.67
       1.050     0.500000        10016         2.00
       1.100     0.550000        11010         2.22
       1.152     0.600000        12007         2.50
       1.201     0.650000        13000         2.86
       1.255     0.700000        14010         3.33
       1.308     0.750000        15003         4.00
       1.339     0.775000        15505         4.44
       1.371     0.800000        16002         5.00
       1.404     0.825000        16499         5.71
       1.440     0.850000        17008         6.67
       1.484     0.875000        17503         8.00
       1.506     0.887500        17749         8.89
       1.529     0.900000        17997        10.00
       1.555     0.912500        18247        11.43
       1.585     0.925000        18495        13.33
       1.620     0.937500        18751        16.00
       1.639     0.943750        18876        17.78
       1.658     0.950000        18998        20.00
       1.682     0.956250        19120        22.86
       1.714     0.962500        19247        26.67
       1.747     0.968750        19373        32.00
       1.769     0.971875        19435        35.56
       1.796     0.975000        19499        40.00
       1.824     0.978125        19558        45.71
       1.859     0.981250        19620        53.33
       1.908     0.984375        19682        64.00
       1.948     0.985938        19713        71.11
       1.990     0.987500        19745        80.00
       2.046     0.989062        19776        91.43
       2.139     0.990625        19807       106.67
       2.267     0.992188        19838       128.00
       2.335     0.992969        19854       142.22
       2.425     0.993750        19870       160.00
       2.543     0.994531        19885       182.86
       2.677     0.995313        19901       213.33
       2.853     0.996094        19916       256.00
       2.925     0.996484        19924       284.44
       3.033     0.996875        19932       320.00
       3.183     0.997266        19940       365.71
       3.329     0.997656        19948       426.67
       3.539     0.998047        19955       512.00
       3.591     0.998242        19959       568.89
       3.801     0.998437        19963       640.00
       3.931     0.998633        19967       731.43
       4.239     0.998828        19971       853.33
       4.371     0.999023        19975      1024.00
       4.551     0.999121        19977      1137.78
       4.663     0.999219        19979      1280.00
       4.687     0.999316        19981      1462.86
       5.103     0.999414        19983      1706.67
       5.179     0.999512        19985      2048.00
       5.491     0.999561        19986      2275.56
       5.495     0.999609        19987      2560.00
       5.703     0.999658        19988      2925.71
       5.839     0.999707        19989      3413.33
       6.179     0.999756        19990      4096.00
       6.179     0.999780        19990      4551.11
       6.411     0.999805        19991      5120.00
       6.411     0.999829        19991      5851.43
       6.847     0.999854        19992      6826.67
       6.847     0.999878        19992      8192.00
       6.847     0.999890        19992      9102.22
       7.267     0.999902        19993     10240.00
       7.267     0.999915        19993     11702.86
       7.267     0.999927        19993     13653.33
       7.267     0.999939        19993     16384.00
       7.267     0.999945        19993     18204.44
       8.263     0.999951        19994     20480.00
       8.263     1.000000        19994          inf
#[Mean    =        1.067, StdDeviation   =        0.411]
#[Max     =        8.256, Total count    =        19994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 30.01s, 1.92MB read
Requests/sec:    999.83
Transfer/sec:     65.42KB