wrk/output/stage_2/3_get_full_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.181ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.152ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.127ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.241ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.20ms  369.20us   5.58ms   70.56%
    Req/Sec   263.13     51.05   444.00     61.65%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.18ms
 75.000%    1.44ms
 90.000%    1.64ms
 99.000%    2.05ms
 99.900%    4.05ms
 99.990%    4.97ms
 99.999%    5.58ms
100.000%    5.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.206     0.000000            2         1.00
       0.763     0.100000         2007         1.11
       0.885     0.200000         4008         1.25
       0.981     0.300000         6004         1.43
       1.087     0.400000         7998         1.67
       1.185     0.500000        10006         2.00
       1.234     0.550000        11006         2.22
       1.283     0.600000        12003         2.50
       1.332     0.650000        13003         2.86
       1.383     0.700000        14005         3.33
       1.438     0.750000        15028         4.00
       1.466     0.775000        15508         4.44
       1.498     0.800000        15998         5.00
       1.529     0.825000        16505         5.71
       1.564     0.850000        17013         6.67
       1.598     0.875000        17507         8.00
       1.617     0.887500        17750         8.89
       1.638     0.900000        17999        10.00
       1.663     0.912500        18252        11.43
       1.688     0.925000        18499        13.33
       1.718     0.937500        18749        16.00
       1.733     0.943750        18872        17.78
       1.751     0.950000        18998        20.00
       1.773     0.956250        19125        22.86
       1.798     0.962500        19249        26.67
       1.830     0.968750        19371        32.00
       1.845     0.971875        19432        35.56
       1.861     0.975000        19496        40.00
       1.885     0.978125        19560        45.71
       1.907     0.981250        19621        53.33
       1.939     0.984375        19682        64.00
       1.963     0.985938        19714        71.11
       1.992     0.987500        19746        80.00
       2.023     0.989062        19777        91.43
       2.059     0.990625        19809       106.67
       2.091     0.992188        19839       128.00
       2.139     0.992969        19854       142.22
       2.201     0.993750        19870       160.00
       2.301     0.994531        19885       182.86
       2.433     0.995313        19901       213.33
       2.601     0.996094        19916       256.00
       2.787     0.996484        19925       284.44
       2.917     0.996875        19932       320.00
       3.057     0.997266        19940       365.71
       3.265     0.997656        19948       426.67
       3.393     0.998047        19955       512.00
       3.459     0.998242        19959       568.89
       3.673     0.998437        19963       640.00
       3.819     0.998633        19967       731.43
       3.989     0.998828        19971       853.33
       4.087     0.999023        19975      1024.00
       4.195     0.999121        19977      1137.78
       4.275     0.999219        19979      1280.00
       4.303     0.999316        19981      1462.86
       4.411     0.999414        19983      1706.67
       4.491     0.999512        19986      2048.00
       4.491     0.999561        19986      2275.56
       4.507     0.999609        19987      2560.00
       4.515     0.999658        19988      2925.71
       4.687     0.999707        19989      3413.33
       4.799     0.999756        19990      4096.00
       4.799     0.999780        19990      4551.11
       4.827     0.999805        19991      5120.00
       4.827     0.999829        19991      5851.43
       4.967     0.999854        19992      6826.67
       4.967     0.999878        19992      8192.00
       4.967     0.999890        19992      9102.22
       5.279     0.999902        19993     10240.00
       5.279     0.999915        19993     11702.86
       5.279     0.999927        19993     13653.33
       5.279     0.999939        19993     16384.00
       5.279     0.999945        19993     18204.44
       5.579     0.999951        19994     20480.00
       5.579     1.000000        19994          inf
#[Mean    =        1.201, StdDeviation   =        0.369]
#[Max     =        5.576, Total count    =        19994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 30.00s, 2.03MB read
Requests/sec:   1000.08
Transfer/sec:     69.20KB