wrk/output/stage_2/4_delete_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.152ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.134ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.167ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.094ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms    2.01ms  66.11ms   99.13%
    Req/Sec   263.51     63.98     1.80k    82.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.15ms
 75.000%    1.41ms
 90.000%    1.62ms
 99.000%    2.89ms
 99.900%   39.68ms
 99.990%   58.69ms
 99.999%   66.18ms
100.000%   66.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.219     0.000000            1         1.00
       0.718     0.100000         2012         1.11
       0.843     0.200000         4010         1.25
       0.949     0.300000         6005         1.43
       1.051     0.400000         8010         1.67
       1.152     0.500000        10018         2.00
       1.205     0.550000        11000         2.22
       1.253     0.600000        12006         2.50
       1.307     0.650000        13015         2.86
       1.359     0.700000        14015         3.33
       1.413     0.750000        15000         4.00
       1.442     0.775000        15510         4.44
       1.476     0.800000        16002         5.00
       1.510     0.825000        16506         5.71
       1.544     0.850000        17000         6.67
       1.583     0.875000        17508         8.00
       1.602     0.887500        17749         8.89
       1.623     0.900000        18001        10.00
       1.644     0.912500        18246        11.43
       1.671     0.925000        18498        13.33
       1.704     0.937500        18746        16.00
       1.725     0.943750        18877        17.78
       1.745     0.950000        18999        20.00
       1.768     0.956250        19122        22.86
       1.795     0.962500        19245        26.67
       1.826     0.968750        19370        32.00
       1.845     0.971875        19433        35.56
       1.870     0.975000        19498        40.00
       1.900     0.978125        19557        45.71
       1.936     0.981250        19621        53.33
       2.006     0.984375        19682        64.00
       2.065     0.985938        19713        71.11
       2.315     0.987500        19745        80.00
       2.597     0.989062        19776        91.43
       3.083     0.990625        19808       106.67
       3.733     0.992188        19838       128.00
       4.199     0.992969        19854       142.22
       4.447     0.993750        19870       160.00
       5.047     0.994531        19885       182.86
       6.475     0.995313        19901       213.33
       8.495     0.996094        19916       256.00
       9.543     0.996484        19924       284.44
      11.815     0.996875        19932       320.00
      13.535     0.997266        19940       365.71
      17.439     0.997656        19948       426.67
      23.167     0.998047        19955       512.00
      27.087     0.998242        19959       568.89
      31.007     0.998437        19963       640.00
      34.943     0.998633        19967       731.43
      38.879     0.998828        19971       853.33
      42.815     0.999023        19975      1024.00
      43.263     0.999121        19977      1137.78
      46.719     0.999219        19979      1280.00
      47.071     0.999316        19981      1462.86
      50.623     0.999414        19983      1706.67
      50.815     0.999512        19985      2048.00
      51.167     0.999561        19986      2275.56
      54.559     0.999609        19987      2560.00
      54.591     0.999658        19988      2925.71
      55.039     0.999707        19989      3413.33
      58.399     0.999756        19990      4096.00
      58.399     0.999780        19990      4551.11
      58.463     0.999805        19991      5120.00
      58.463     0.999829        19991      5851.43
      58.687     0.999854        19992      6826.67
      58.687     0.999878        19992      8192.00
      58.687     0.999890        19992      9102.22
      62.367     0.999902        19993     10240.00
      62.367     0.999915        19993     11702.86
      62.367     0.999927        19993     13653.33
      62.367     0.999939        19993     16384.00
      62.367     0.999945        19993     18204.44
      66.175     0.999951        19994     20480.00
      66.175     1.000000        19994          inf
#[Mean    =        1.282, StdDeviation   =        2.008]
#[Max     =       66.112, Total count    =        19994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 30.01s, 1.95MB read
Requests/sec:    999.86
Transfer/sec:     66.40KB